index.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2026-01-14 Wed 18:16 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Home Page</title>
<meta name="author" content="Cam A." />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="styles.css">
</head>
<body>
<div id="content" class="content">
<h1 class="title">Home Page</h1>
<p>
Hello, my name's Cam.
I'm a student at Aberystwyth University interested in (among other things)
</p>
<ul class="org-ul">
<li>Programming</li>
<li>Mathematics</li>
<li>Literature</li>
<li>Brewing</li>
</ul>

<p>
With programming, I mainly use GNU Emacs &#x2013; I don't really like the idea of a favourite language, but I mainly use and enjoy Haskell, misc lisps, and C.
I also don't really subscribe to a single paradigm either.
OOP can be elegant for certain problems (though I am yet to find an OOP language that I can really find elegant, I'd like to try Smalltalk at some point), functional for others, logic for others, it's the horse for the course.
Some of the programming that I do I put up on <a href="https://github.com/vibe-876">my Github</a>, though most of it stays on my local machine.
</p>

<p>
On the mathematical side, I'm obsessed with mathematical analysis and graph theory.
Similarly to my opinions on programming languages, I don't really like the divide between pure and applied maths either, it's more about how you approach the problem.
I feel like everything is either applied, or will be at some point: if category theory can find applications, anything can.
</p>

<p>
This website is written in org mode, with some CSS on the side, because I don't like writing HTML.
</p>

<p>
If for some reason you want to read about the various things that I do, I have <a href="blog.html">a blog</a>!
</p>

<p>
Some of my friends have websites too (all better than this one), and I think you should check them all out :) .
</p>
<ul class="org-ul">
<li><a href="https://shaiyaj.github.io">Shaiya</a></li>
<li><a href="https://amositty.netlify.app">Adam</a></li>
<li><a href="https://guns.lol/attie">Attie</a></li>
<li><a href="http://edmil.net/">Edmil</a></li>
</ul>
</div>
</body>
</html>
